---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.Insert(Autodesk.Revit.DB.Mechanical.Space)
source: html/c6c72497-450f-804e-17f3-d1000ee9cb1d.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	Space item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Mechanical.Space`)